f = open('pitext.txt', 'w')

f.write(input('Введите числа: '))
f.close()

pi = '''14159265358979323846264338327950288419716939937510582097494459230781640628620899862803482534211706798214808651328230664709384460955058223172535940812848111745028410270193852110555964462294895493038196'''
#200
l = c = 0
with open('d:\piproject\pi\pitext.txt') as f:
    for n, i, j in zip(range(1, len(pi) + 1), f.readline(), pi):
        if i == j:
            c += 1
        else:
            print(':( [%d] %s -> %s' % (n, i, j))
            l += 1
print ('---\n:) - %d\n:( - %d' % (c, l))